# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

a = 10
b = 20
c = 30

str_a = 'a = ' + str(a) + ';'
str_b = 'b = ' + str(b) + ';'
str_c = 'c = ' + str(c) + ';'
print(str_a, str_b, str_c)

user_a = input('please input a number: ')
print('you just input:', user_a)
