# Задание - 2
# Создайте функцию, принимающую на входе 3 числа, и возвращающую наибольшую из них


def max_num(a, b, c):
    return max(a, b, c)


print(max_num(1, 5, 2))





